let 색깔 = ['갈색','개나리색','검정','귤색','금색','군청색','남색','노란','녹색','다홍색','담청색','라벤더색','라임색','밤색','베이지색','보라색','분홍색','빨간','살색','연두색','은색','자주색','자홍색','주황색','청록색','초록색','파란','하얀','하늘색','회색',]
let 과일 = ['석류','감','포도','배','레몬','사과','파인애플','아로니아','복숭아','구아바','코코넛','칼라만시','유자','자몽','수박','멜론','블랙베리','블루베리','암바렐라','무화과',
'레드향','한라봉','귤','천혜향','토마토','딸기','체리','타마릴로','복분자','아보카도','두리안','설향멜론','올리브','백도','신고','키위','바나나','천도복숭아','살구','매실','라임','람부탄','망고스틴','크랜베리','골드키위','청포도','으름','금귤','다래','머루'
,'산딸기','거봉','방울토마토','영귤','패션프루트','감귤','샤인머스켓','여주','용과','만다린','스타프루트','포멜로','금감','시라','아사이베리','꽃사과','청견','망고','캔털루프','플럼코트','몽키바나나','판타오','핑거라임','오디','참외','건포도'
,'자바애플','쿠푸아수','두쿠','양광','구기자','구즈베리','대추야자','오렌지','두꾸','마르멜로','스타애플','스위티','페피노','리슬링','샤르도네','살라크','머스크멜론','모과','그린망고','파파야','홍옥','델라웨어','가보스','앵두','자두','메론']

const Nickname = ()=> {
    let name1 = 색깔[Math.floor(Math.random() * 색깔.length)];
    let name2 = 과일[Math.floor(Math.random() * 과일.length)];
    return name1+name2;    
}
module.exports = Nickname;